////题目内容：
////
////给定一个日期，数据格式为YYYY - MM - DD，输出这个日期是该年的第几天。
////
////提示 : 一年十二个月每个月的天数可以作为一维数组的元素
////
////
////
////输入格式:
////
////输入代表这个日期的年月日信息, scanf语句中的格式控制串为 : "%d-%d-%d"
////
////
////
////输出格式：
////
////输出是当年的第几天 printf中的格式控制串为 "%d\n"
////
////
////
////输入样例：
////
////2018 - 9 - 11
////
////
////
////输出样例：
////
////254
//
//
//
//
//
//#include<stdio.h>
//int main() {
//	int year, month, day, i, daysum=0;
//	scanf("%d - %d - %d", &year, &month, &day);
//	if (year % 4 == 0) {
//		int calendar[] = { 31,29,31,30,31,30,31,31,30,31,30,31 };
//		for (i = 0; i < month - 1;i++) {
//			daysum += calendar[i];
//		}
//		daysum += day;
//	}
//	if (year % 4 != 0) {
//		int calendar[] = { 31,28,31,30,31,30,31,31,30,31,30,31 };
//		for (i = 0; i < month - 1; i++) {
//			daysum += calendar[i];
//		}
//		daysum += day;
//	}
//	printf("%d", daysum);
//	return 0;
//}